app/Controllers/Autorizacion.php

    public function doRegister()
    {
        $model = new UsuarioModel();
        $session = session();

        // Validar datos (sin campo nombre)
        $rules = [
            'email' => 'required|valid_email|is_unique[usuarios.email]',
            'password' => 'required|min_length[6]',
            'confirmar' => 'required|matches[password]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Preparar datos (sin campo nombre)
        $data = [
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'rol' => 'estudiante' // Por defecto, nuevo usuario es estudiante
        ];

        // Guardar usuario
        if ($model->insert($data)) {
---
INSERT INTO `usuarios` (`email`, `password`, `rol`, `created_at`, `updated_at`) VALUES ('fede_valdes93@hotmail.com', '$2y$10$H2pUewKgJjFxF4mdVEnKruhvMteIqrsfj2v9aKGekynaSa5N/f7Ue', 'estudiante', '2025-10-28 13:10:31', '2025-10-28 13:10:31')

    public function doLogin()
    {
        $session = session();
        $model = new UsuarioModel();

        // Recibe los datos del formulario
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Busca el usuario por email
        $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'fede_valdes93@hotmail.com'
 LIMIT 1