app/Controllers/Autorizacion.php

    public function doLogin()
    {
        $session = session();
        $model = new UsuarioModel();

        // Recibe los datos del formulario
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Busca el usuario por email
        $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'ez@gmail.com'
 LIMIT 1