app/Controllers/CarrerasController.php

    public function crear()
    {
        $data = [
            'categorias' => $this->categoriaModel->findAll(),
            'profesores' => $this->profesorModel->findAll(),
            'titulo' => 'Registrar Nueva Carrera',
        ];
---
SELECT *
FROM `categorias`
SELECT *
FROM `profesores`