app/Controllers/CategoriasController.php

    public function index()
    {
        $data = [
            'categorias' => $this->categoriaModel->findAll(),
            'titulo' => 'Gestión de Categorías',
        ];
---
SELECT *
FROM `categorias`

    public function actualizar()
    {
        $data = $this->request->getPost();
        $id = $data['id'];

        // ✅ VERIFICAR QUE LA CATEGORÍA EXISTA
        if (!$categoriaExistente = $this->categoriaModel->find($id)) {
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '1'