app/Controllers/ProfesoresController.php

SELECT *
FROM `profesores`
---
    public function index()
    {
        $data = [
            'profesores' => $this->profesorModel->findAll(),
            'titulo' => 'Gestión de Profesores',
        ];