app/Models/CarreraModel.php

SELECT `carreras`.*, `categorias`.`nombre` as `nombre_categoria`, `profesores`.`nombre` as `nombre_profesor_a_cargo`
FROM `carreras`
JOIN `categorias` ON `categorias`.`id` = `carreras`.`categoria_id`
JOIN `profesores` ON `profesores`.`id` = `carreras`.`profesor_id`
---
    public function obtenerCarrerasDetalle()
    {
        return $this->select('carreras.*, categorias.nombre as nombre_categoria, profesores.nombre as nombre_profesor_a_cargo')
                    ->join('categorias', 'categorias.id = carreras.categoria_id')
                    ->join('profesores', 'profesores.id = carreras.profesor_id')
                    ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `carreras`
WHERE `nombre` = 'Economia'
---
    public function esNombreUnico($nombre, $id = 0)
    {
        $builder = $this->where('nombre', $nombre);

        if ($id > 0) {
            $builder->where('id !=', $id);
        }

        return $builder->countAllResults() === 0;

SELECT COUNT(*) AS `numrows`
FROM `carreras`
WHERE `codigo` = '002'
---
    public function esCodigoUnico($codigo, $id = 0)
    {
        $builder = $this->where('codigo', $codigo);

        if ($id > 0) {
            $builder->where('id !=', $id);
        }

        return $builder->countAllResults() === 0;

INSERT INTO `carreras` (`nombre`, `codigo`, `duracion`, `categoria_id`, `profesor_id`) VALUES ('Economia', '002', '4', '2', '2')
---
    public function insert($data = null, bool $returnID = true)
    {
        // Validar nombre único antes de insertar
        if (isset($data['nombre']) && !$this->esNombreUnico($data['nombre'])) {
            $this->errors['nombre'] = 'Ya existe una carrera con este nombre.';
            return false;
        }

        // Validar código único antes de insertar
        if (isset($data['codigo']) && !$this->esCodigoUnico($data['codigo'])) {
            $this->errors['codigo'] = 'El código de carrera ya está en uso.';
            return false;
        }

        return parent::insert($data, $returnID);