app/Models/CategoriaModel.php

SELECT COUNT(*) AS `numrows`
FROM `categorias`
WHERE `nombre` = 'Ingenieria'
---
    public function esNombreUnico($nombre, $id = 0)
    {
        $builder = $this->where('nombre', $nombre);

        if ($id > 0) {
            $builder->where('id !=', $id);
        }

        return $builder->countAllResults() === 0;

INSERT INTO `categorias` (`nombre`, `descripcion`) VALUES ('Ingenieria', 'Formación profesional de ingenieros')
---
    public function insert($data = null, bool $returnID = true)
    {
        // Validar nombre único antes de insertar
        if (isset($data['nombre']) && !$this->esNombreUnico($data['nombre'])) {
            $this->errors['nombre'] = 'Ya existe una categoría con este nombre.';
            return false;
        }

        return parent::insert($data, $returnID);

SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '1'
UPDATE `categorias` SET `nombre` = 'Tecnicatura', `descripcion` = 'Consiste en la formación de técnicos para ocupar roles que constan de tareas de alta complejidad'
WHERE `categorias`.`id` IN ('1')
---
    public function update($id = null, $data = null): bool
    {
        // Si el nombre cambió, validar que sea único
        if (isset($data['nombre']) && $id) {
            $categoriaExistente = $this->find($id);
            if ($categoriaExistente && $data['nombre'] != $categoriaExistente['nombre']) {
                if (!$this->esNombreUnico($data['nombre'], $id)) {
                    $this->errors['nombre'] = 'Ya existe una categoría con este nombre.';
                    return false;
                }
            }
        }

        return parent::update($id, $data);