app/Models/EstudianteModel.php

    public function obtenerEstudiantesConCarrera()
    {
        return $this->select('estudiantes.*, carreras.nombre as nombre_carrera')
                    ->join('carreras', 'carreras.id = estudiantes.carrera_id')
                    ->findAll();
---
SELECT `estudiantes`.*, `carreras`.`nombre` as `nombre_carrera`
FROM `estudiantes`
JOIN `carreras` ON `carreras`.`id` = `estudiantes`.`carrera_id`